<template>
  <tk-container class="container" @scroll="handle">
    <tkui-header center slot="header">
      <tkui-button class="icon" slot="left-menu" @click.native="go">
        <tk-icon>return_a</tk-icon>
      </tkui-button>
      合作介绍
    </tkui-header>
    <div class="textBody">
      <ol>
        <li>
          <span>亲爱的小呦车主：</span>
          <p style="text-indent: 2em;">
            您好，欢迎您加入＂<strong>YOYO爱车</strong>＂的大家庭，我们将竭诚为您和您的爱车进行服务。在
            这里，您可以在日常的驾驶行程中，顺便赚一些油费贴补一下你的爱车；您也可以享受到完全
            免费或超低折扣的洗车等服务。下面我就＂<strong>YOYO爱车</strong>＂的服务做一个详细的说明，请务必仔细阅读
            (尤其是标黑体部分)：
          </p>
        </li>
      </ol>
      <ol>
        <li>
          <h3>(一)服务流程</h3>
        </li>
        <li>1.我们根据客户提出的需求，设计、制作车膜广告。</li>
        <li>
          2.车模广告粘贴于车辆的后车窗（根据面积不同，补贴的油费也不同，具体参考费用
          报酬）
        </li>
        <li>
          3.车模广告位半透膜(在车里看车外完全透光，但是车外看车里完全不透光),所以
          您完全不用担心会阻挡你的后视镜的视线。
        </li>
        <li>
          4.车膜广告材质为易粘贴易撕下材质，所以您完全不用担心会对您爱车的车窗玻璃造
          成损伤或影响您爱车的美观。
        </li>
        <li>
          5.我们会在微信公众号和APP中发布广告任务信息，如果您同意，请点击＂确认＂，并在
          规定时间内到指定地点粘贴车膜广告。
        </li>
        <li>
          6.我们所发布的广告任务信息具有时效性，如果您在一定的时间内没有点击＂确认＂，则
          视为您已主动放弃此广告任务。同时，我们发布的广告任务信息还具有数量限制（比如，我
          们需要100辆车，我们会向150辆车发布任务消息，前100名点击＂确认＂的车主可以接受此任务，
          第100名之后的将无法接受此任务）。
        </li>
        <li>
          7.广告任务期结束后（一般广告任务的时间为一个月），<strong>请在广告任务期结束的1周之内使用A
          PP中的实时拍照功能（我的 — 我的任务）拍照上传，然后您才可以撕下车膜广告。</strong>我们会在您拍照
          上传后的1周之内给您下发您的费用报酬（具体请关注APP中的信息）。
        </li>
      </ol>
      <ol>
        <li>
          <h3>(二)运费报酬</h3>
        </li>
        <li>
          <strong>
            每次广告的费用报酬会在您领取广告任务时一起发布。
          </strong>
        </li>
        <li>
          <strong>
            注：在非广告任务时间段，是没有费用报酬的。但
            是你可以参加APP中其他优惠活动。
          </strong>
        </li>
      </ol>
      <ol>
        <li>
          <h3>(三)注意事项</h3>
        </li>
        <li>
          <strong>
            1.车主接受我们发布的广告任务信息并点击＂确认＂后，请务必
            按照我们发布的规定时间段到达指定地点粘贴广告；如果您因为某种原因（不可
            抗力除外）无法在规定时间到达指定地点，我们将视为你已主动放弃此项广告
            任务，并且会降低您的信用评估（以后您将不再作为优先车主对你发布广告任务
            ）。
          </strong>
        </li>
        <li>
          <strong>
            2.车主请不要在广告任务期未结束前撕下车膜广告，如果您在广告任务期结束时（撕
            下车膜广告之前）未能及时（1周之内）使用APP中的实时拍照功能（我的 — 我的任
            务）拍照上传，则视为您已经自愿放弃了领取此广告任务的费用报酬，我们将不再为
            您提供此广告任务的报酬。
          </strong>
        </li>
        <li>
          <strong>
            3.如果为了获得费用报酬而使用作弊的手段，一经核实，我们将不再为您提供此次广
            告任务的报酬，而且以后也不再为您提供广告任务；所以，为了所有车主的公平，为
            了您的诚信，请自愿规范自己的行为和原则。
          </strong>
        </li>
        <li>
          <strong>
            4.为了您的个人隐私安全和费用报酬的安全，请不要私下承接任何（包括但不限于我公
            司的员工）除＂YOYO爱车＂APP通知消息以外的任何广告任务。
          </strong>
        </li>
      </ol>
      <ol>
        <li>
          <h3>(四)其他服务</h3>
        </li>
        <li>
          我们将不定期的在APP中发布一些洗车、爱车养护的优惠活动、还有各种爱车生活小贴士、健
          康养生小妙招、您还可以通过推荐好友换取积分，并在积分还礼中换取你需要的礼品或服务
          ，后续我们还在不断更新和添加更多的功能，更多的乐趣等待您的发现。
        </li>
      </ol>
    </div>
  </tk-container>
</template>
<script>
  export default {
    data () {
      return {
        height: 1
      }
    },
    methods: {
      handle (opt) {
        this.height = opt
      },
      go () {
        this.$back()
      }
    }
  }
</script>
<style lang="scss" scoped>
  @import "../assets/scss/main.scss";
  .container{
    .textBody{
      padding: 15px;
      ol{
        margin-bottom:20px;
        li{
          padding:10px 0;
        }
      }

    }
  }

</style>
