<template>
  <tk-container class="container" @scroll="handle">
    <tkui-header center slot="header">
      <tkui-button class="icon" slot="left-menu" @click.native="go">
        <tk-icon>return_a</tk-icon>
      </tkui-button>
      服务标准和合作协议
    </tkui-header>
    <div class="textBody">
      <ol>
        <li>
          <h2 style="text-align: center">服务合作协议：</h2>
          <p style="text-indent: 2em;">
            河北若风科技有限公司（以下简称我公司）作为＂<strong>YOYO爱车</strong>＂ 应用程
            序的拥有者和运营者，根据客户提出的需求信息向应用程序的用户（以下
            简称车主）提供服务，信息平台经过信息数据处理后，在客户端上向符合条件
            主发布信息，并完成最终匹配后进行线下服务。在您使用本应用程序之前，请
            你仔细阅读本协议（尤其是粗体标注部分）。<strong>一旦您登陆本应用程序、通过应用程
            序接单或服务于客户，则视作您已充分阅读并且同意《服务合作协议》（以下简称协议
            ）的全部内容，并自愿遵守该《服务合作协议》的各项规定。此协议对您和我公司具有
            同等法律约束力。如果您不同意本《平台服务协议》，则不能登陆本APP、接单或服务客户。</strong>
          </p>
        </li>
        <li>
          <h3 style="text-align: center">第一条 服务合作期</h3>
          <strong>
            我公司和您向客户的服务合作时间为我公司要求的时间段（一般以月计数），并向您提供服务的费
            用报酬。在未向客户提供服务合作的时间段属于非服务合作期，在非服务合作期内，我公司不需要向
            您提供费用报酬。但你可以关注平台的信息，等待新的服务合作信息和参加平台推出的各项活动。
          </strong>
        </li>
        <li>
          <h3 style="text-align: center">第二条 服务合作费用</h3>
          <strong>
            您已同意我公司按照不定期更新的费用标准支付您服务客户的费用报酬。
          </strong>
        </li>
        <li>
          <h3 style="text-align: center">第三条 车主违约责任</h3>
          <strong>
            所有车主都必须按照本公司的要求向客户提供服务，如果出
            现注册和实际车辆信息不符、车主未完成本公司要求，在未到合作期满
            结束，私自终止向客户提供服务、通过作弊手段骗取报酬，车主应对行为
            承担违约责任，包括但不限于：扣除服务客户的费用报酬、支付违约金、
            暂停接受服务、终止合作等。同时我公司保留诉诸法律的权利和及时对追
            责方法和标准调整的权利。
          </strong>
        </li>
      </ol>
      <ol>
        <h3 style="text-align: center">您登陆应用程序，通过应用程序服务客户，您做出如下承诺和保证：</h3>
        <li>
          <h3>(一)您满足以下车主标准:</h3>
          <p>C1以上驾照，驾驶习惯良好。</p>
          <p>身体健康，无下列疾病：</p>
        </li>
        <li>1.严重心脏病。</li>
        <li>
          2.癫痫。
        </li>
        <li>
          3.眩晕症。
        </li>
        <li>
          4.精神心理疾病。
        </li>
        <li>
          5.痴呆及影响正常驾驶的疾病。
        </li>
        <li>
          6.眼疾影响正常驾驶。
        </li>
        <li>
          7.其他影响正常驾驶的疾病。
        </li>
        <li>
          8.吸食毒品及成瘾性药物未戒除。
        </li>
        <li>
          9.国家和地方实施的法律、法规另有规定的，应满足法律、法规条件。
        </li>
        <li>
          无犯罪记录、无交通肇事犯罪记录、无危险驾驶犯罪记录、无饮酒后驾驶记录、无吸毒史、无精神疾病史、最近3个月记分周期内未计满12分、三年内无重大交通事故。
        </li>
      </ol>
      <ol>
        <li>
          <h3>（二）您的车辆符合以下标准：</h3>
        </li>
        <li>
          1.车辆为蓝色牌照车辆，车牌清晰。
        </li>
        <li>
          2.车辆无改装。
        </li>
        <li>
          3.无重大交通事故，车况良好。
        </li>
        <li>
          4.车辆证件和配件齐全（包括强险标志、环保标志、检验合格标志、行驶证、维修保养手册、工具包、灭火器、备胎等）
        </li>
        <li>
          5.国家和地方实施的法律、法规另有规定的，应满足法律、法规条件。
        </li>
        <li>
          <h3>（三）手机硬件准入标准</h3>
        </li>
        <li>
          适用于<strong>ANDROID</strong>操作系统为<strong>ANDROID2.3</strong>以上版本及操作系统为<strong>IOS7.0</strong>以上的苹果手机。对于在其他操作系统平台使用本应用可能出现的任何问题，恕不承担任何责任。
        </li>
      </ol>
      <ol>
        <li>
          <h3 style="text-align: center">第五条 免责条款</h3>
          <strong>
            无论车主是否在服务合作期内，如发生交通事故、违章行为、其他违反国家和地方实施的法律、法规的行为，均有车主自行承担责任，与本公司无任何关系。
          </strong>
        </li>
        <li>
          <h3 style="text-align: center">第六条 特别约定</h3>
          <p>此信息平台的运营权和最终解释权归我公司所有。</p>
          <p>
            本协议内容包括已经发布和即将发布的各项内容，均属于本协议不可分割的部分，与本协议具
            有同等的法律效力。在协议履行过程中，我公司可视情况对内容进行修改，一旦内容发生变动
            ，我公司将在平台上公布最新的协议。如果您不同意新的协议内容，您有权利停止使用本公司服
            务；如果您继续使用本公司服务，则视为您已接受新的协议内容，并遵守修改后的协议执行。
          </p>
          <br>
          <strong>
            在您注册和使用我公司的应用程序过程中，您同意并提供您的照片、手机号、车辆信息等个人信息，
            此类信息将仅限于我公司应用程序的使用和服务，我公司将采取有效的措施保护你的个人隐私，除法
            律或有法律赋予权限的政府部门要求或您同意等原因外，我公司未经您同意不会向除合作单位以外的任
            何第三方公开、透露您的个人信息或使用您的个人信息开展业务。
          </strong>
          <br>
          <p>
            在你使用给我公司的应用程序过程中产生的通讯数据流量费用，有通讯运营商提供和收取，我公司不收取通讯服务和流量费用。
          </p>
          <br>
          <strong>
            我公司于车主之间仅存在挂靠合作关系，不存在任何直接或间接的劳动关系，不适用于《劳动法》、《劳动合同法》、
            《社会保险法》、《住房公积金管理条例》等法律法规。
          </strong>
        </li>
      </ol>
    </div>
  </tk-container>
</template>
<script>
  export default {
    data () {
      return {
        height: 1
      }
    },
    methods: {
      handle (opt) {
        this.height = opt
      },
      go () {
        this.$back()
      }
    }
  }
</script>
<style lang="scss" scoped>
  @import "../assets/scss/main.scss";
  .container{
    .textBody{
      padding: 15px;
      ol{
        margin-bottom:20px;
        li{
          padding:10px 0;
        }
      }

    }
  }
  p{
    padding: 10px 0;
  }
</style>
